00test/oldtest/injectionChannel_turb/0/k.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5;

boundaryField
{
    walls
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }

    lowerInlet
    {
        type            fixedValue;
        value           uniform 10.0;
    }

    upperInlet
    {
        type            fixedValue;
        value           uniform 10.0;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 1.5;
        value           uniform 1.5;
    }

    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
