00test/oldtest/injectionChannel_turb/0/nut.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0002;

boundaryField
{
    walls
    {
        type            nutUWallFunction;
        value           uniform 0;
    }

    lowerInlet
    {
        type            fixedValue;
        value           uniform 0.0225;
    }

    upperInlet
    {
        type            fixedValue;
        value           uniform 0.0225;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 0.0002;
        value           uniform 0.0002;
    }

    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
